test_inlet5/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 2.3039e-5;

boundaryField
{

    frontAndBack
    {
	    type 		empty;
    }
    
    leftAndRight
    {
        type             compressible::alphatJayatillekeWallFunction;
         Prt             0.85;
         value           uniform 0;
    }

	
	Baffle
	{
        type            compressible::alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
	}

    cabinet
    {
        type            compressible::alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    cold
    {
        type            compressible::alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    inlet
    {
	    type            fixedValue;
        value           $internalField;
    }

    outlet
    {
	    type            zeroGradient;
    }
    



}



// ************************************************************************* //
