test_inlet5/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
	// LeftandRight
	// {
	// 	type kqRWallFunction;
	// 	value $internalField;
	// }
        // frontAndBack
        // {
        //         type kqRWallFunction;
        //         value $internalField;
        // }   

   frontAndBack
    {
        type            empty;
    }

    leftAndRight
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    cabinet
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    cold
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    
    outlet
    {
        type            zeroGradient;
    }
        Baffle
        {
                type kqRWallFunction;
                value $internalField;
        } 

}




// ************************************************************************* //
